app/controllers/stores_controller.rb

     def set_store
      @store = Store.find(params[:id])
---
SELECT "stores".* FROM "stores" WHERE (st_dwithin(lonlat,'0020000001000010e6c055e8a28f0ba11f4044f49bffa5672d',800))